ERM/src/Documents/КорректировкаТранзакции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>КорректировкаТранзакции</Name>
			<BasedOn>
				<xr:Item>Document.ТранзакцияHOB</xr:Item>
				<xr:Item>Document.ТранзакцияOracle</xr:Item>
				<xr:Item>Document.ПроводкаDSS</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.BilledAR</xr:Item>
				<xr:Item>AccumulationRegister.Payments</xr:Item>
				<xr:Item>AccumulationRegister.UnallocatedCash</xr:Item>
				<xr:Item>AccumulationRegister.UnallocatedMemo</xr:Item>
				<xr:Item>AccumulationRegister.Revenue</xr:Item>
				<xr:Item>AccumulationRegister.ManualTransactions</xr:Item>
				<xr:Item>AccumulationRegister.UnbilledAR</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПроводкаDSS</v8:Type>
						<v8:Type>cfg:DocumentRef.ТранзакцияOracle</v8:Type>
						<v8:Type>cfg:DocumentRef.ТранзакцияHOB</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Oracle</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LegalEntity</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LegalEntiites</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДетализацияПоКлиенту</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Client</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BaseAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERM/src/Enums/ТипыСоответствий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыСоответствий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Lawson</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OracleSmith</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OracleMI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HOBs</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьCRM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьParentClients</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sun</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ERM/src/Documents/КорректировкаТранзакции/Ext/ManagerModule.bsl
Функция ПолучитьРеквизитыТранзакции(Документ) Экспорт
	
	ЗначенияРеквизитовТранзакции = Новый Структура("Source, ТранзакцияCompany, ТранзакцияLocation, ТранзакцияAccount, ТранзакцияSubSubSegment, ТранзакцияCurrency, ТранзакцияAU, ТранзакцияClient , ТранзакцияLegalEntity, ТранзакцияAmount, ТранзакцияBaseAmount");
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПроводкаDSS") Тогда
		ЗначенияРеквизитовDSS = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "Company, Location, AccountLawson, SubSubSegment, Currency, AU, КонтрагентLawson , LegalEntity, BaseAmount, TranAmount");
		ЗначенияРеквизитовТранзакции.Source = Перечисления.ТипыСоответствий.Lawson;
		ЗначенияРеквизитовТранзакции.ТранзакцияClient = ЗначенияРеквизитовDSS.КонтрагентLawson;
		ЗначенияРеквизитовТранзакции.ТранзакцияAccount = ЗначенияРеквизитовDSS.AccountLawson;
		ЗначенияРеквизитовТранзакции.ТранзакцияCompany = ЗначенияРеквизитовDSS.Company;
		ЗначенияРеквизитовТранзакции.ТранзакцияLocation = ЗначенияРеквизитовDSS.Location;
		ЗначенияРеквизитовТранзакции.ТранзакцияSubSubSegment = ЗначенияРеквизитовDSS.SubSubSegment;
		ЗначенияРеквизитовТранзакции.ТранзакцияCurrency = ЗначенияРеквизитовDSS.Currency ;
		ЗначенияРеквизитовТранзакции.ТранзакцияAU = ЗначенияРеквизитовDSS.AU;
		ЗначенияРеквизитовТранзакции.ТранзакцияLegalEntity = ЗначенияРеквизитовDSS.LegalEntity;
		ЗначенияРеквизитовТранзакции.ТранзакцияAmount = ЗначенияРеквизитовDSS.TranAmount;
		ЗначенияРеквизитовТранзакции.ТранзакцияBaseAmount = ЗначенияРеквизитовDSS.BaseAmount;
		Возврат ЗначенияРеквизитовТранзакции;
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ТранзакцияHOB") Тогда
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "Company, Location, Account, SubSubSegment, Currency, AU, Client , LegalEntity, Amount, BaseAmount");
		ЗначенияРеквизитовТранзакции.Source = Перечисления.ТипыСоответствий.HOBs;
		ЗначенияРеквизитовТранзакции.ТранзакцияClient = ЗначенияРеквизитов.Client;
		ЗначенияРеквизитовТранзакции.ТранзакцияAccount = ЗначенияРеквизитов.Account;
		ЗначенияРеквизитовТранзакции.ТранзакцияCompany = ЗначенияРеквизитов.Company;
		ЗначенияРеквизитовТранзакции.ТранзакцияLocation = ЗначенияРеквизитов.Location;
		ЗначенияРеквизитовТранзакции.ТранзакцияSubSubSegment = ЗначенияРеквизитов.SubSubSegment;
		ЗначенияРеквизитовТранзакции.ТранзакцияCurrency = ЗначенияРеквизитов.Currency ;
		ЗначенияРеквизитовТранзакции.ТранзакцияAU = ЗначенияРеквизитов.AU;
		ЗначенияРеквизитовТранзакции.ТранзакцияLegalEntity = ЗначенияРеквизитов.LegalEntity;
		ЗначенияРеквизитовТранзакции.ТранзакцияAmount = ЗначенияРеквизитов.Amount;
		ЗначенияРеквизитовТранзакции.ТранзакцияBaseAmount = ЗначенияРеквизитов.BaseAmount;
		Возврат ЗначенияРеквизитовТранзакции;
	Иначе
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "Source, Company,  AU, Location, Account, SubSubSegment, Currency, Client , LegalEntity, Amount, BaseAmount");
		ЗначенияРеквизитовТранзакции.Source = ЗначенияРеквизитов.Source;
		ЗначенияРеквизитовТранзакции.ТранзакцияClient = ЗначенияРеквизитов.Client;
		ЗначенияРеквизитовТранзакции.ТранзакцияAccount = ЗначенияРеквизитов.Account;
		ЗначенияРеквизитовТранзакции.ТранзакцияCompany = ЗначенияРеквизитов.Company;
		ЗначенияРеквизитовТранзакции.ТранзакцияAU = ЗначенияРеквизитов.AU;
		ЗначенияРеквизитовТранзакции.ТранзакцияLocation = ЗначенияРеквизитов.Location;
		ЗначенияРеквизитовТранзакции.ТранзакцияSubSubSegment = ЗначенияРеквизитов.SubSubSegment;
		ЗначенияРеквизитовТранзакции.ТранзакцияCurrency = ЗначенияРеквизитов.Currency ;
		ЗначенияРеквизитовТранзакции.ТранзакцияLegalEntity = ЗначенияРеквизитов.LegalEntity;
		ЗначенияРеквизитовТранзакции.ТранзакцияAmount = ЗначенияРеквизитов.Amount;
		ЗначенияРеквизитовТранзакции.ТранзакцияBaseAmount = ЗначенияРеквизитов.BaseAmount;
		Возврат ЗначенияРеквизитовТранзакции;
	КонецЕсли;
		
КонецФункции
